Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/D03.tmx
Source language: en_us
Languages: zh_cn

source: The Mystery Babylon Religion
zh_cn: 巴比伦的秘密宗教

source: As we've already noted, the religion created in Babylon by Nimrod and Semiramis is known as the Mystery Religion or simply The Mysteries. At its core, it was an inverted re-telling of the fall of man in Genesis.
zh_cn: 我们已经知晓，宁录与塞米勒米斯在巴比伦所创立的宗教是秘密宗教，或者秘术，其核心是创世纪人类堕落的扭曲版本。

source: In the Biblical account of the incident, the serpent caused Adam and Eve to sin against God by suggesting they eat the fruit from the tree of knowledge. Because they acted in disobedience to God who had specifically told them not to eat from that tree, sin entered into the human race and all the misery, disease and tragedy that makes up human history stems from that moment.
zh_cn: 圣经中，蛇劝亚当和夏娃吃分别善恶树的果子、人类犯罪离开上帝，因为上帝曾特别地叮嘱他们不能吃分别善恶树上的果子，而他们没有听从，罪于是进入了人类，那一刻凄惨、疾病、悲剧在人类历史里生根发芽。

source: In the Babylonian inversion of this event however, the serpent is portrayed as the real good god. He was worshipped for opening the eyes of men and for infusing the woman with his passion and lust.
zh_cn: 巴比伦版本的创世纪里，蛇被描述为正义的神祗，并因打开了男人的眼睛、将激情和欲望放入女人的身体而被膜拜。

source: He was seen as a liberator and an enlightener. To them, he illuminated the minds of mankind by revealing to them the secret knowledge that God had tried to keep from them.
zh_cn: 撒旦被视为一个解放者和启发者，他声称将上帝所隐藏的知识赐给了人类，撒旦因此被披戴上了光明。

source: The secret serpent knowledge that could provide mankind with their own salvation and which would see them become gods.
zh_cn: 这个来自古蛇（古龙）的知识，将使人类自我救赎、并使人类有能力“修炼”成神。

source: That is why the religion is called the Mysteries - Because it claims to harbour this secret knowledge that was offered to Adam and Even in the Garden of Eden.
zh_cn: 这就是这样的宗教叫做“秘密宗教”——因为它声称将神秘的知识给了伊甸园的那两个人。

source: In the Mysteries, the true God of Abraham, Isaac and Jacob, Yahweh, was portrayed as a wrathful Deity of hate, who was guilty of opposing freedom of choice.
zh_cn: 秘密宗教里，亚伯拉罕、以撒、雅各的神——耶和华，被描述为一个充满忌妒和愤怒的神，并且不给人类自由。

source: ASTROLOGY & HOROSCOPES
zh_cn: 占星术与星座

source: Because Nimrod and Semiramis set themselves up as the sun and moon gods, the religion also made use of a corruption of primeval astronomy.
zh_cn: 因为宁录和塞米勒米斯将他们自己设立为太阳神和月神，所以巴比伦的秘密宗教就使用早期天文学的堕落形式、为己所用。

source: It was believed by Noah's righteous ancestors that the stars told the story of Satan's rebellion against God in heaven, his fall, subversion of mankind, the promise of a Messiah who would suffer and die to lift the curse of sin and then be installed as Lord of creation and conqueror of Satan.
zh_cn: 挪亚公义敬虔的祖先确信，撒旦的反叛、人类的瓦解、未来弥赛亚的应许（受苦并死亡、除去罪的咒诅）、上帝的创造被重整、撒旦被征服的一系列，都通过天空的星象系统显现出来。

source: These stories were widely known amongst the people of the time.
zh_cn: 当时的人类广泛地知道这些故事。

source: Semiramis however, again inverted the story and so in the Mysteries the stars of the sky told a different story. In the Babylonian version, Satan was depicted as the rightful lord of the universe, whose throne has only been temporarily usurped by God.
zh_cn: 但是塞米勒米斯将这个故事颠覆了，在巴比伦版本的秘密宗教，天上的星象讲述了一个另外的故事：撒旦是宇宙公义的君王，他的宝座仅是被上帝暂时篡取了。

source: One day an anti-Christ, a seed of the serpent, would be born of a divine mother, would become god himself, replace God and return rulership of the world to the serpent.
zh_cn: 一位敌基督、古蛇（古龙）的后裔，有一天将被一个“神圣”的母亲生出来，将世界的统治权还给古蛇(古龙)，取代上帝。

source: Semiramis claimed that this was the real hidden truth concealed within the stories.
zh_cn: 塞米勒米斯宣布，这才是被隐藏的真理。

source: This corrupt and satanic version is the origin of astrology, which still exists virtually unchanged today.
zh_cn: 这个堕落的、撒旦版本的故事即是原始的占星术/ 星座学，它依然存在至今。

source: The Babylonians didn't just believe the stars told the story of the universe. They believed you could divine the future of individuals through them as well.
zh_cn: 巴比伦人不单认为星象在讲述宇宙的故事，而且他们相信，通过星象，可以预知每个人的未来。

source: If the stars told the stories of things that had passed they could also tell the stories of things to come.
zh_cn: 他们的逻辑是，既然星辰可以显现过去，那么一定也可以预知未来。

source: They would therefore divide the sky into sections and give meanings to each section on the basis of the stars that are found there.
zh_cn: 所以他们将整个星空分为不同的区域/ 座落，并将各个区域命名、给予不同的意义。

source: According to the theory, a person's destiny is said to be determined by whatever section or "sign" he is born under.
zh_cn: 在巴比伦人的理论里，每个人的一生，都是根据所出生的星域/ 星座确定。

source: This is the origin of horoscopes.
zh_cn: 这就是星座的起源。

source: In times to come, astrology would pass to the empire of ancient Egypt, which is the location we most associate with pyramids today.
zh_cn: 后来，这种占星术又被传到古埃及帝国，也就是现今有金字塔的地区，那里，所有的“圣山”。

source: The 'sacred mountain' pyramids were constructed with certain mathematical relationships to the stars.
zh_cn: 金字塔都是依据占星术、精密计算后建造的。

source: By the time Moses led the Jews out of Egypt in Exodus, astrology had also infected the population in Canaan which was the land that they were headed towards.
zh_cn: 摩西带领犹太人出埃及、向迦南地（现以色列地区）进发的时候，占星术早已影响到了那些迦南人的生活方式。

source: Hence, some of the strictest warnings in the Bible against astrology date from this period (Lev. 19:31; Deut. 18).
zh_cn: 因此旧约圣经里，上帝多次严厉地警告以色列人不要参与占星术。

source: The Biblical denunciations of astrology identify the practice with demonism or Satanism in the sense that Satan and his hosts were actually being worshiped in the guise of the signs, planets and stars. And as mentioned previously, the leading lights of the sky - sun and moon - were worshipped in the form of Nimrod and Semiramis.
zh_cn: 圣经里谴责占星术，是因为撒旦化身为（占星术的）这些符号、行星、恒星获得人类的敬拜；前文我们也提到过，天空的两个主要光源---太阳和月亮，也以宁录和塞米勒米斯的名号被敬拜。

source: Very significantly, a third leading light was identified in the sky that was 23 times more luminous than the sun and therefore was considered to be the most important star in the sky. It is known as the "dog star", "Sirius", or "The morning star" because it is still visible even in the morning light.
zh_cn: 很重要的是，天空中第三亮的星星实际上比太阳亮23倍（只是距离地球很遥远），因此可以算是天空中最重要的星星；它也被称作天狼星或者“早晨之星”，因可以在早上被看见。

source: Remember in Isaiah 14:12 Lucifer is referred to as the morning star.
zh_cn: 以赛亚书14章说，路西法被称为早晨之星。

source: When allied with the sun and moon, the dog star completes an unholy trinity of lights personified in Satan, Nimrod and Semiramis.
zh_cn: 天狼星和太阳、月亮一起，构成了一个邪恶的三位一体，也就是撒旦、宁录和塞米勒米斯。

source: HIERARCHY
zh_cn: 等级制度

source: One of the key elements of the Mysteries that I also want to emphasise is the hierarchical structure that they contained.
zh_cn: 秘密宗教的一个显著特征，必须强调，是等级结构组织和制度。

source: The secret illuminating knowledge from the serpent was not to be freely distributed to the unworthy. You would have to become initiated into the religion and then work your way through ascending degrees of revelation and knowledge. This ascension through the levels was considered to be a journey from the darkness of ignorance to the light of knowledge.
zh_cn: 那条古蛇(古龙)可不会轻易地将隐秘知识告诉那些不配得的人群，你进入秘密宗教以后，必须努力往上爬，从而得到更高等级的启示和知识：这是一条从黑暗无知到”知识亮敞“的旅程。

source: Progression was propagated by a hierarchy of priests and priestesses and were marked by fearful rites of passage and oaths of secrecy, which, if broken, would lead to death.
zh_cn: 男祭司和女祭司将带着你进阶，方式是，参加令人恐惧的仪式、并宣誓保密，否则死亡将等着你。

source: Similar oaths of secrecy are sworn today by other hierarchical institutions like the freemasons and Jesuits.
zh_cn: 像共济会、天主教耶稣会都有类似的等级组织和保密宣誓仪式。

source: More about them later.
zh_cn: 后文我们会提到关于共济会、耶稣会更多的知识。

source: The further along in the process you were, the more enlightened you were considered. The more enlightened you were, the more you could look down your nose at the unenlightened.
zh_cn: 进阶越深，你得到的”知识亮敞“的程度越高，同时在你屁股下面的那些”不亮敞“的猴子也越多。

source: The hierarchical structure of the Mysteries was designed to create inequality amongst men based on what they knew. It can itself can be best visualised in the form of a pyramid or ziggurat again. Wide at the base and increasingly narrow as you rise through the levels towards the peak.
zh_cn: 秘密宗教的设计原理是，将获得知识的多少，作为人与人间不平等的标准，就像金字塔结构，下宽上窄。

source: The idea is that there is an average mass of people at the bottom of the pyramid who are ignorant blind fools with an increasingly small number of enlightened people towards the top. The very top, the capstone as it were, is Lucifer himself, the giver of the light.
zh_cn: 金字塔下头有一大堆不明真相的傻瓜，而在顶端则是路西法，他给人们“光“。

source: If you've read or seen Harry Potter you'll be vaguely familiar with this concept.
zh_cn: 如果你看<哈利-波特>时，会模糊地意识到同样的概念：

source: In those stories, the name 'muggle' is given to the majority of people in the world who go about their lives utterly oblivious to the wizarding world that is actually all around them or at least very close at hand. We are encouraged to think of muggles as idiots and indeed the Oxford English Dictionary has even picked up on the word and defines it as "an individual who is clumsy or unable to acquire a new skill.
zh_cn: 大多数人都是麻瓜（Muggle，不会魔法的人），他们不知道在身边就是险象环生的魔法世界；我们觉得Muggle是傻瓜，而<牛津字典>给个Muggle的定义是，懒惰或者无能力获得新技能的人。

source: " Those who were born into a muggle family but have been awakened to wizardry are called 'mudbloods' i.e. half bloods, and this places you on a higher position than a muggle but a lower position to those who have centuries of pure wizardry in their ancestry.
zh_cn: 那些出生在普通家庭被魔法世界唤醒的人，被称为”泥巴种（Mudbloods）“，这是比麻瓜更高一阶的人，但较世代生活在魔法世界家族的人，他们依然比较低阶。

source: JK Rowling here, as in many aspects of her books is actually giving insights into real occultism.
zh_cn: 乔安妮·罗琳（JK Rowling，<哈利-波特>作者）的书中，非常多的层面和内容都牵涉到秘术。

source: The word "occult" means "hidden" or "concealed" and it is the modern name by which the ideas of the Mysteries have come to be known today.
zh_cn: 秘术（occultism）的意思是，“隐藏”或者“隐匿”，也就是现代英语中所提到的秘密宗教。

source: When you have people involved in the occult today, the information, knowledge and power they are trying to tap into, is the exact same as that serpent knowledge which originated in Babylon.
zh_cn: 当今日人们参与秘术时，所有的信息、知识、能力，和当时起源于巴比伦的古蛇的知识是一致的。

source: The idea of occultism retains the concept that there are a powerful, enlightened or illuminated few at the top who see things as they really are and the rest are kept in the dark. Mere ignorant fools. The enlightened few consider the average mass of people to be almost sub-human. Like cattle, who deserve to be led like cattle and treated like cattle.
zh_cn: 秘术保留了这样的概念：在顶端，有能力的、“亮敞”的少数人看清楚了宇宙，而其他人仍在蒙昧中，并且，这些少数人认为其他人都为次等人、理应被当作牲畜使唤。

source: This knowledge hierarchy is replicated in almost all occult societies today, like freemasonry for example, and it fulfils an important function of allowing Satan to pervert by small degrees.
zh_cn: 在今日的任何一个秘密社会/ 组织里，都存在因知识差别所形成的等级结构，如共济会（Freemasonry），并让撒旦滥用这样的等级制度来运作。

source: Those at the lower levels of freemasonry have no idea of what they are actually involved in. It is only as they slowly rise through the degrees that they have the true information revealed to them.
zh_cn: 共济会里，低等级的会员对他们所加入的组织一无所知，只有他们的级别渐渐上升时，才有可能获得一些新的信息。

source: By perverting in small stages and in the passing of time, people lose sight of just how far they're straying and can be led to accept things that they would have otherwise flatly rejected if they had been given the full revelation from the start.
zh_cn: 随着时间的流逝，这些会员开始迷失，并且开始接受一些知识，而这些知识若一开始就告诉他们，他们是无法接受的。

source: Just a little change here, a little change there ­it's not so much.
zh_cn: 这里一点改变、那里一点改变....

source: And yet with enough small changes and with enough time, a person or society can be completely transformed without even realising it.
zh_cn: 就这样，足够的时间以后，人和社会被改造得面目全非。

source: This is one of the reasons why we must have a zero tolerance policy with sin. The concessions we make today will form a link in a chain of concessions in future if we're not careful.
zh_cn: 这就是为什么我们应当对“罪（sin)“零容忍：若不注意，今日我们所迁就的一丝，将成为未来我们所让步的一列。

source: This kind of system that needs to keep knowledge concealed from the masses, by its very nature, necessitates the use of symbolism, gestures, monuments, secret words and signs to ensure that those in the dark are kept in the dark. That's why the occult makes heavy use of these devices. They use symbols that are packed with meaning for the initiated by which mean absolutely nothing to the average man. By using symbols, information can be communicated by being 'hidden in plain sight'. That is, they are in the open air for all to see, but they are not recognised or interpreted by the average person.
zh_cn: 秘密宗教里，知识向广大内部成员隐藏了，而象征、手势、遗迹、隐晦的言语和符号，都保证了在蒙昧中的大多数依旧蒙昧，对于创立者有意义的符号，对于普通内部成员则毫无意义；使用这些符号时，他们根本不明白、也无法解释都在说些什么、做些什么。

source: It is also for this reason that the occult always hides behind outward facades of neutrality, goodness or even holiness. I mentioned this earlier but don't expect evil to have an obvious outward appearance of evil.
zh_cn: 也是因为以上的原因，秘术总是隐藏在中立、甚至是 “好“和”圣洁“的伪装底下，早先我也提过，不要认为邪恶会将它自己显露出来-------

source: That's not how Satan wins people to himself. More often than not he disguises himself as an angel of light to seduce, which is why discernment becomes one of our most important tools in the last days.
zh_cn: 这也是撒旦夺取人类灵魂的方式，通常他会将自己打扮成光明的天使来引诱人类，所以分辨诸灵的洞察力，也成为了末世最重要的能力之一。

source: It is also for this same reason that dual meanings are prevalent in the occult world. Wherever there is a dark infernal truth to be communicated, there is almost always a false, but light and seemingly good cover story. The public are given the false cover story in order to keep the dark truth concealed.
zh_cn: 基于此，在秘术世界里，每件事总是有双重的意思： 哪里有来自黑暗地狱的事物，那里就有一个看上去光明的积极的故事来匹配、装饰它，黑暗以此被隐藏。

source: The initiated and the enlightened only are aware of the true meanings. By using this system of double-speak and deception, occultists can speak a sentence containing words which mean something to fellow occultists, but which mean something very different to the average person.
zh_cn: 通过这样的欺骗手法，参与秘术的人可以对同伴讲述一个意思，但这些知识到了普通人那里，意思就南辕北辙了。

source: Bernie Taupin, Elton John's lyricist, is reported to have once said that he never wrote a single song that wasn't written in this double speak. The average listener hears Elton John's lyrics and either doesn't discern a message at all or thinks they discern a light and wholesome one, while in reality, they are telling quite a different message to the initiated.
zh_cn: 伯尼 · 陶平（Bernie Taupin）和埃尔顿·约翰（ Elton John）的歌曲，曾被认为是，每一首的歌词都有两个所指：普通听众要么完全分辨不出来，要么认为他们感受到的是有关光明完美的内容，而其实正好相反。

source: Closely related to this concept is the idea that light and darkness emanate from the same source.
zh_cn: 和以上这个概念（双重意义）相近的，是一个关于“光明和黑暗来自同一个源头“的理论。

source: Nimrod and Semiramis were the sun and the moon, the leading lights of the day and the night, but they were two separate manifestations of the same source - Satan.
zh_cn: 虽然宁录与塞米勒米斯被认为是太阳和月亮——白天和晚上照射在地球上的统治级光源，但他们是来自同一个源头——撒旦。

source: So the idea is that there is one force which has a light masculine side and a dark feminine side.
zh_cn: 在这个理论里，有一种力量有阳性的一面、亦有阴性的一面。

source: If you've seen Star Wars you'll be familiar with this concept. The Force is considered neutral but can be used for good or evil.
zh_cn: 如果你看过《星球大战》，你对这个理论一定很熟悉，这个力量是中性的，可以用于正义，也可以用于邪恶。

source: Or what about the Wizard of Oz where it explains there can be good witches or bad witches.
zh_cn: 在《美妙的精灵 Wizard of Oz》里，出现了好精灵和坏精灵。

source: This is key to occultism. The power is neutral, it's how you use it that counts.
zh_cn: 这是秘术的关键，那个力量是中性的，取决于你如何使用它。

source: And speaking of songs with double meanings, Bernie Taupin also of course wrote the lyrics to a Wizard of Oz related song, Goodbye Yellow Brick road.
zh_cn: 回过头看，伯尼·陶平（Bernie Taupin）的歌曲——一首歌的双重意义——伯尼·陶平就曾为《美妙的精灵》写歌词，那首歌的名字叫做《再见，黄砖路》。

source: The Wizard of Oz has an occult message that we'll get to later.
zh_cn: 《美妙的精灵》里的秘术信息我们稍后讲。

source: But these are themes that have infiltrated our culture and these are some key tell-tale signs of satanic mystery religion. Look out for them as we continue our journey.
zh_cn: 我们的文化已经浸润了不少这样的主题，这是一个显示撒旦秘术宗教的刻度仪表盘，在我们应多加小心。
